{
  "home": {
    "title": "An open source Flash Player emulator",
    "intro": "Made to run natively on all modern operating systems and browsers, Ruffle brings Flash content back to life with no extra fuss.",
    "safe": "Safe to use",
    "safe-description": "Using the guarantees of Rust and WASM, we avoid the security pitfalls Flash was known for.",
    "easy": "Easy to install",
    "easy-description": "Whether you're a user or a website owner, we've made it as easy as possible to get up and running.",
    "free": "Free and open source",
    "free-description": "Licensed MIT/Apache 2.0, you're free to use Ruffle how you please!"
  },
  "header": {
    "about": "About Ruffle",
    "downloads": "Downloads",
    "compatibility": "Compatibility",
    "contribute": "Get Involved",
    "blog": "Blog",
    "demo": "Demo",
    "discord": "Discord",
    "github": "GitHub"
  },
  "footer": {
    "github": "GitHub",
    "social-x": "X",
    "tiktok": "TikTok",
    "instagram": "Instagram",
    "mastodon": "Mastodon",
    "discord": "Discord",
    "tagline": "Putting Flash back on the web"
  },
  "logo": {
    "alt-tag": "Ruffle Logo"
  },
  "404": {
    "not-found": "Page not found",
    "not-found-description": "The requested page could not be found."
  },
  "installers": {
    "windows-64-short-name": "Windows (64-bit)",
    "windows-long-name": "Windows Executable",
    "windows-32-short-name": "Windows (32-bit)",
    "macos-short-name": "macOS",
    "macos-long-name": "Mac Application",
    "flatpak-short-name": "Flatpak",
    "flatpak-long-name": "Flatpak App",
    "linux-short-name": "Linux",
    "linux-long-name": "Linux Executable",
    "chrome-short-name": "Chrome",
    "chrome-long-name": "Chrome Extension",
    "edge-short-name": "Edge",
    "edge-long-name": "Edge Extension",
    "firefox-short-name": "Firefox",
    "firefox-long-name": "Firefox Extension",
    "safari-short-name": "Safari",
    "safari-long-name": "Safari Extension",
    "selfhosted-short-name": "Self Hosted",
    "selfhosted-long-name": "Website Package",
    "other-downloads": "Other Downloads"
  },
  "downloads": {
    "version": "Version",
    "desktop-app": "Desktop Application",
    "desktop-app-description": "If you want to run Flash content on your computer without a browser in-between, we have native applications that will take full advantage of your GPU and system resources to get those extra frames when playing intense games.",
    "browser-extension": "Browser Extension",
    "browser-extension-description": "If you visit websites that have Flash content but aren't using Ruffle, or you want to ensure you're using the latest and greatest version of Ruffle on every website, then our browser extension is the perfect thing for you!",
    "nightly-releases": "Nightly Releases",
    "nightly-releases-description": "If none of the above are suitable for you, you can manually download the latest Nightly release. These are automatically built every day (approximately midnight UTC), unless there are no changes on that day. Older nightly releases are available on {{link}}.",
    "web-package": "Web Package",
    "web-package-description": "You can install Ruffle onto a website using one single line of code by using a CDN, no extra work required! It'll always stay up to date with the latest available version of Ruffle.",
    "self-host-description": "If you'd like to host it yourself, you can grab {{link}} and upload it to your server. Then, include it on your page like so:",
    "self-host-description-link": "the latest self-hosted package",
    "advanced-usage-description": "For advanced usage, consult {{link}} for our JavaScript API and installation options.",
    "advanced-usage-description-link": "our documentation",
    "chrome-extension-alt": "Available in the Chrome Web Store",
    "firefox-extension-alt": "Get the Add-On for Firefox",
    "edge-extension-alt": "Get it from Microsoft for Edge"
  },
  "compatibility": {
    "title": "ActionScript Compatibility",
    "description": "The biggest factor in content compatibility is ActionScript; the language that powers interactivity in games and applications made with Flash. All Flash content falls in one of two categories, depending on which version of the language was used to create it.",
    "tracking": "We track our progress in each AVM by splitting them up into two different areas:",
    "language-description": "The {{language}} is the underlying virtual machine itself and the language concepts that it understands, like variables and classes and how they all interact together.",
    "language": "Language",
    "api-description": "The {{api}} is the underlying virtual machine itself and the language concepts that it understands, like variables and classes and how they all interact together.",
    "api": "API",
    "avm1-title": "AVM 1: ActionScript 1 & 2",
    "avm1-description": "AVM 1 is the original ActionScript Virtual Machine. All movies made before Flash Player 9 (June 2006) will be made with AVM 1, and it remained supported & available to authors until the release of Flash Professional CC (2013), after which point content started moving to AVM 2.",
    "avm1-support": "We believe that most AVM 1 content will work, but we are aware of some graphical inaccuracies and smaller bugs here and there. Please feel free to report any issues you find that are not present in the original Flash Player!",
    "avm2-title": "AVM 2: ActionScript 3",
    "avm2-description": "AVM 2 was introduced with Flash Player 9 (June 2006), to replace the earlier AVM 1. After the release of Flash Professional CC (2013), authors are required to use ActionScript 3 - making any movie made after that date very likely to fall under this category.",
    "avm2-support": "Ruffle now has decent support for AVM 2, and it's our experience that most games will work well enough to be played. We're still rapidly improving in this area though, so bug reports about any broken content are always welcome!",
    "weekly-contributions": "Weekly Contributions",
    "done": "done",
    "partial": "partially done",
    "more": "More Info",
    "commits-description": "{{commitNumber}} commits on the week of {{week}}",
    "avm2": {
      "title": "ActionScript 3 API Progress",
      "description": "ActionScript 3 contains many different methods and classes - not all of which is ultimately useful to every application. The majority of content only uses a small portion of the available API, so even if we aren't 100% \"complete\" across the entirely of AVM 2, we may have enough for that content to run completely fine.",
      "classification": "On this page, we list every single ActionScript 3 API that exists but Ruffle does not yet 100% implement. We classify items into three different stages:",
      "implemented": "Implemented",
      "implemented-description": "{{implemented}} items are marked as \"Done\", and we believe they are fully functional. For brevity, we do not list completed items on this page.",
      "partial": "Partial",
      "partial-description": "{{partial}} items exist and are enough for most content to work, but are incomplete. A partial class may be missing items, or a method may just simply return a value without performing its intended function.",
      "missing": "Missing",
      "missing-description": "{{missing}} items do not exist at all in Ruffle yet, and trying to use them will give an error.",
      "tree": "You can also visualize the progress {{link}}.",
      "tree-link": "as a tree graph",
      "top-level": "(Top Level)",
      "package-level": "(Package Level)",
      "hide": "Hide",
      "show": "Show",
      "missing-members": "Missing Members",
      "done": "Done"
    }
  },
  "contribute": {
    "involved": "Get Involved",
    "involved-description": "Ruffle is an entirely open source project, maintained by volunteers like you who just want to help preserve a slice of history. We rely on contributions of any kind to keep this project going, and absolutely would not have come as far as we have without the amazing support of our community who came together to make Ruffle happen. If you'd like to join them, there are many ways to help make Ruffle better than ever!",
    "code": "Contribute code",
    "code-description": "There's a few different codebases in couple of different languages, and we'd welcome any help to try and maintain and improve them.",
    "rust": "The actual {{emulator}} itself, and all of the {{desktop-player}}, is written in Rust.",
    "emulator": "emulator",
    "desktop-player": "desktop player",
    "typescript": "The {{web-player}}, the {{extension}} and our {{website}} is written in TypeScript.",
    "web-player": "web player",
    "extension": "extension",
    "website": "website",
    "getting-started": "Check out our {{guidelines}} for information on how to start, and come join our {{discord}} if you need help!",
    "guidelines": "Contributing Guidelines",
    "test": "Test content",
    "test-description": "Arguably more important than contributing code is testing Ruffle out. Go install Ruffle and try out your favourite games and animations. Look for any difference from the official Flash Player, and report your findings to us.",
    "report-bugs": "If you find any bugs, changes of behaviour, performance issues or any visual differences then please report those to our {{bug-tracker}}.",
    "bug-tracker": "our bug tracker",
    "working": "If it runs flawlessly, come share the good news on {{our-discord}}!",
    "our-discord": "our Discord",
    "sponsor": "Sponsor the project",
    "sponsor-description": "If you are able and willing to, we welcome any and all financial support to help us fund the project going forward. With your help, we can afford to spend more time dedicated to Ruffle, as well as pay for expenses such as build servers & hosting. We accept donations and sponsorships of any kind, big or small, through Open Source Collective 501(c)(6).",
    "sponsor-info": "For more information, or to view the options available for sponsoring the project, please visit {{opencollective}}.",
    "opencollective": "our Open Collective page",
    "spread-the-word": "Spread the word!",
    "spread-the-word-description": "Is your favourite Flash-based site shutting down? Let them know they can add one JavaScript file and keep it running! Feeling nostalgic for some old Flash games? Go play some on Newgrounds with Ruffle installed, and tell your friends about it! Maybe you're a streamer and looking for some silly content? There's literally decades worth, now unlocked and accessible once more.",
    "diamond": "Diamond Sponsors",
    "diamond-description": "We'd like to thank all of our sponsors, who help make this project possible. Below are our Diamond level sponsors, without whom we would not be here. Thank you."
  },
  "blog": {
    "read-more": "Read more...",
    "20230312": {
      "title": "First post, progress report!"
    },
    "20230423": {
      "title": "A post-mortem of Ruffle's removal from addons.mozilla.org"
    },
    "20230529": {
      "title": "Ruffle News - May 2023"
    },
    "20240114": {
      "title": "2023 in review"
    },
    "20240912": {
      "title": "Optimisations, Text Input, Tab Focusing and More!"
    }
  }
}
